[
 {
  "name": "Dipsea Trail",
  "description": "The trail starts with 688 stairs as the trail leaves Mill Valley. After crossing Muir Woods Rd, the trail begins climbing fairly steeply up Mt. Tam on a sometimes rooty singletrack. The climb tops out on Cardiac Hill at a four-way intersection. Continue straight as the woods are left behind and the sky opens in front of you.  Climb for awhile longer and then the trail will begin to roll, not gently but overall down nonetheless.  \r\n\nThe trail enters the woods for section followed by a long set of downhill stairs before you cross a bridge and head left.  The trail climbs steeply and then, once again, begins rolling.  Finally, the trail will cross Panoramic Highway, continue a short distance more before the final set of stairs leading to Shoreline Highway.",
  "location": "Mill Valley, CA"
 },
 {
  "name": "Kortum Trail",
  "description": "Some parts of this trail are paved and accessible. There are some ascents/descents over uneven ground. Hikers will enjoy breathtaking views of the Sonoma coast. There is beach access in some locations.",
  "location": "Bodega Bay, CA"
 },
 {
  "name": "Redwood Grove Loop Trail",
  "description": "This trail begins at the visitor center and meanders beneath giant trees towering hundreds of feet overhead. Keep an eye out along the trail for various wildlife including banana slugs. As you round the loop through the trees keep an eye out for the albino redwood! This trail is a great for families because it is so wide, flat, and smooth. If you find yourself getting warm on a hot day the shade provided by the giant redwoods makes for a great escape from the heat!",
  "location": "Mount Hermon, CA"
 },
 {
  "name": "SCA Trail",
  "description": "A hike along the SCA Trail will provide a breathless vista of the Golden Gate Bridge and the surrounding Bay. When the sun is shining and the fog is lifted, hiking along this trail will make memories that will last a lifetime. Every resident of Marin County and San Francisco county need to experience what the Golden Gate looks like from this north side.  \r\n\nThe trail is cut into the side of the mountain and faces westward. This well-maintained trail is a very well kept secret - don't miss it!",
  "location": "Sausalito, CA"
 },
 {
  "name": "Whittemore Gulch Trail",
  "description": "This is a close competitor for the singletrack with the best scenery in the Bay Area. This trail has it all, ocean views, close contact with huge redwoods, fern canyons and creeks. The trail is not very technical so you can enjoy taking in the scenery along the way.",
  "location": "Half Moon Bay, CA"
 },
 {
  "name": "Point Reyes Lighthouse Trail",
  "description": "Hike along the rocky coastline of Point Reyes on a paved path for a little over 1/2 of a mile to reach the famous Point Reyes Lighthouse. Along the way you'll see a visitor center for the lighthouse. After you've learned all about the lighthouse and taken in all the views of the scenic coastline you can return back to the parking area the way you came.\r\n\nThanks to John McKinney, The Trailmaster, for sharing this trail description. To learn more about trails in California, check out his guides at The Trailmaster Store.",
  "location": "Inverness, CA"
 },
 {
  "name": "Chimney Rock",
  "description": "This trail is a crowd pleaser!  Short and sweet, it ambles atop 500ft. cliffs, taking in amazing coastline views.  The trail is named for a rock outcrop that looks a bit like a chimney.  Springtime (April and May) is wonderful time here for wildflowers.    \r\n\nSome of the best whale watching can be done from here-  look for the spouts from grey whales making their way from Alaska to Baja, Mexico (January to May).  Elephant seals can often be spotted lounging on the beaches below.  \r\n\nThis easy trail is often foggy and windy, but on clear days the Farallon Islands are visible about 20 miles off the coast.  Note: bikes are allowed on this trail.",
  "location": "Inverness, CA"
 },
 {
  "name": "Pirates Cove Trail",
  "description": "Picture just you, the chaparral, the crashing waves, the sky, and a trail that runs along the rugged coast just south of Muir Beach. The Pirate's Cove Trail is probably what you've been imagining. \n\nFrom the north, connect to this trail from a section of the Coastal Trail at Muir Beach. When you first get on the trail, stand perfectly still and see if you can take in the moan of the buoy that is just off shore. The spooky noise is unique to the area, and is worth a listen.\n\nAt the halfway point, you'll be at the cove. There is a little spur that takes you to the occasional beach. Time your trip accordingly, because if the tide is high and or the swell is big, there wont be a beach! \n\nFrom the cove, the remaining trail becomes quite strenuous; the steps and terrain are steep. Many find that poles are a very good option going up or down this section. Once you reach the top you can opt to head north or south to regain the Coastal Trail.",
  "location": "Tamalpais Valley, CA"
 },
 {
  "name": "Ohlone Bluff Trail",
  "description": "This trail connects the parking areas at the east and west ends of Wilder Ranch State Park hugging the coastline along the edge of oceanside cliffs. From the west end, the trail starts near Four Mile Beach looping around a pond out to the edge of the cliffs. With the ocean on one side, on the inland side, field crops are still grown in the summer. The trail turns inland at Three Mile Beach and runs along the railroad tracks before turning back towards the ocean. At the eastern end, the trail merges with the Old Cove Landing Trail.\r\n\nTrail can get muddy in wet weather so best to avoid after big storms.\r\n\nThe trail can be done as an easy out and back or can be combined with inland trails for a more challenging loop.",
  "location": "Santa Cruz, CA"
 },
 {
  "name": "Point Bonita Trail",
  "description": "This frequently-visited, paved walkway leads to the Point Bonita Lighthouse, often referred to as \"the gate keeper to the San Francisco Bay.\" Looking back toward the coast line, there are views into Bonita Cove and then out to the \"Potato Patch Shoal\" once you reach level ground. If the iron gates are opened, the lighthouse is open to visitors. Continue through the tunnel and when you come out the other end, cross the bridge down to the Point Bonita Lighthouse. Crossing the bridge is limited to a few people at a time. \r\n\nWatch for ships and boats as they come and go and have your binoculars and camera ready at all times.",
  "location": "Tamalpais-Homestead Valley, CA"
 },
 {
  "name": "Bear Gulch Cave Trail",
  "description": "From the Moses Spring Trail, head directly south at the junction marked by a sign and metal gate.  Before reaching the cave, the trail moves along the bottom of Bear Gulch where it comes to a metal walkway that passes over a creek and then squeezes between a split rock.  Shortly following this begins the cave.  Move around a large rock and through the metal gate and begin ascending Bear Gulch Cave.  The cave includes stairways protected by railings, small waterfalls, scrambling, tight squeezes, and metal walkways.  If only half of the cave is open, which is typically the case, an exit over a metal walkway will be to the west, which will lead directly to the Moses Spring Trail.  Follow the Moses Spring Trail to either Bear Gulch Reservoir to the south or the parking area to the north.\r\n\nIf the full cave is open, immediately before the exit to Moses Spring Trail, a narrow staircase within the cave leads to another metal gate.  Pass through the metal gate and follow the trail through the rest of the cave.  This part of the cave is extremely dark and requires crossing over and through the stream that runs through the cave.  Look for white arrows on the cave walls that mark the route.  Continue following the arrows until the trail eventually emerges into light and again joins the Moses Spring Trail right beneath the stairs heading up to Bear Gulch Reservoir.",
  "location": "Soledad, CA"
 },
 {
  "name": "Bluff Trail",
  "description": "From the trailhead just south of Spooners Cove, follow the well-defined, well-marked trail for 2 miles to the parking area on the opposite end.  The trail closely follows the edge of a bluff along the rocky Pacific Ocean shoreline with views of Morro Bay to the north.",
  "location": "Los Osos, CA"
 },
 {
  "name": "High Peaks Trail",
  "description": "From the trailhead at the junction with the Moses Spring Trail, follow this gradually ascending trail as it moves past chaparral-covered hillsides and lichen covered rock formations.  Pass the junction for the Rim Trail and continue on up past the obvious rock formations called The Carousel and The Anvil.  Passing The Anvil, the trail opens up with a gulch on the southwest side of the trail and a series of pinnacles on the north-east side.  The most recognizable of the pinnacles to the northeast are Pipsqueak Pinnacle and The Snout.  In the gulch to the southwest, look for a pinnacle called The Unmentionable, named thus for obvious reasons.\r\n\nContinuing along, the trail levels out for a short distance and a cliff face called Pinch or Lynch Wall can bee seen up beyond on the trail and slightly to the left.  The trail eventually leads to a small man-made tunnel near the rock formations called Sew What Needles.  Looking northeast, formations like The Flat-Iron, Salathe's Sliver, Nelson's Needle, and Generation Gap Pinnacle are easily visible.  At this point, the trail begins to make a more steep ascent through a series of switchbacks before it levels out at the junction with the Tunnel Trail and the Steep and Narrow Section of the High Peaks Trail.  A small bathroom is located here as well.  It is also possible to access Scout Peak (2,605 ft, 794m) by hiking off-trail from this location.\r\n\nThe Steep and Narrow section of the High Peaks Trail consists of narrow stairs carved into the rock by the Civilian Conservation Corps in the 1930s, as well as narrow passages protected by wooden walkways that pass over steep cliffs.  This is indeed the highlight of the High Peaks Trail.  Many rock formations are easily seen from this section of the trail, the most notable being Photographer's Delight, Long's Folly, The Fingers, and Condor Crags.\r\n\nFollowing the Steep and Narrow Section, the trail meets the junction with the Tunnel Trail before opening up and descending towards Condor Gulch and the junction with the Condor Gulch Trail.  Continue past the Condor Gulch Trail and chaparral-covered hillsides to where the trail ends at the Bench Trail.",
  "location": "Soledad, CA"
 },
 {
  "name": "Cerro Alto",
  "description": "Take Highway 41 to the Cerro Alto Campground exit. Continue all the way to the end of the road to where the trailhead is. Take the trail to the top, there isn't really much other than that.  \r\n\nThere are a couple nice shaded areas along the lower part, the rest is pretty open.  Be sure to pack water and sunscreen. The trail is a tough climb, as it is 2.7 miles of all uphill. Thankfully it is a pretty steady climb, so once you get going, there are few surprises.  \r\n\nOnce at the peak, enjoy the great views of the entire county.",
  "location": "Atascadero, CA"
 },
 {
  "name": "Cypress Grove Trail",
  "description": "Leave the parking lot in a northern direction and keep left. This lollipop hike will take you to the actual Point Lobos after which the park is named. The loop portion starts at 0.15 miles and can be done in either direction. Turning left you'll soon reach a great open viewpoint on the bluffs. The big rocks towards the west are called South Point, the rocks to the north that are a little further away are Pinnacle Point. If you are lucky, you might even see whales from here. Continue further along the shore line. At 0.5 miles, there is a short spur trail to your left that leads to another good view point of Cypress Cove and North Point. Reach the end of the loop and return to the parking lot.",
  "location": "Carmel-by-the-Sea, CA"
 },
 {
  "name": "North Shore Trail",
  "description": "Head up the natural stairs from the Cannery Point parking lot. A small spur loop will be to your right giving you a good view of Whaler's Cove and Coal Chute Point. Another short spur trail straight ahead just a little further leads you to another good viewpoint. Turn left to stay on this trail. Bluefish Cove will soon emerge on the right. The trail then enters pine forest. Cabin Trail and Whaler's Knoll Trail join on the left at 0.2 and 0.3 miles. Keep Whalers Knoll on your left. Another good view of Bluefish Cove is shortly thereafter to your right. The trail then turns west with Big Dome to your right and then south to leave the pine forest again and reach the parking lot on the other end of the park.",
  "location": "Carmel-by-the-Sea, CA"
 },
 {
  "name": "Moses Spring Trail",
  "description": "The trailhead is accessed at the junction with the Bear Gulch Trail and the High Peaks Trail.  At the junction, continue to ascend slightly passed a large rock formation called The Heffalump to the west of the trail.  A little further ahead, the trail passes through a small man-made tunnel and rock formation called The Guardian at the tunnel's entrance.  After the tunnel, the trail passes over a rock bridge and meets the junction to the Bear Gulch Cave Trail.  \r\n\nContinue west past the Bear Gulch Cave Trail where the trail turns directly south where Discovery Wall and Moses Spring Wall meet.  Follow the trail south along as it moves between, around, and over rocks.  A rock formation called The Camel is visible from this part of the trail high up on the Moses Spring Wall.\r\n\nShortly before the end of the trail, the huge cuboid formation called The Monolith will come into view.  The trail heads around The Monolith to the east.  Near this area is the mid-point exit of the Bear Gulch Cave.  Continuing around The Monolith, the trail eventually dips down into Bear Gulch and passes beneath several chockstones as well as passes over several small bridges.  Here the trail meets with the Bear Gulch Cave Trail before turning south, passing beneath another large chockstone and then ascending some narrow stairs to its end at the Bear Gulch Reservoir.",
  "location": "Soledad, CA"
 },
 {
  "name": "Soberanes Point Main Trail",
  "description": "No fees to park, no bathrooms or visitor center.",
  "location": "Carmel-by-the-Sea, CA"
 },
 {
  "name": "Balconies Cave Trail",
  "description": "If entering from the Balconies Trail, begin this trail by climbing over a large rock formation next to Machete Ridge, which sits to the east, and beneath another rock formation called Chockstone Dome.  \r\n\nContinue through a metal gate and pass beneath a series of smaller chockstones inside of a gravel filled cleft.  From here, continue climbing and scrambling through the cave, using your flashlight or headlamp to reveal the path.  \r\n\nEventually, the cave opens up near another metal gate.  Pass through the metal gate and follow the small stream by scrambling over some more rocks till the trail opens up a bit before coming to a junction with Old Pinnacles Trail and the Balconies Cliffs Trails.\r\n\nThis trail requires some small stream crossings in parts.",
  "location": "Soledad, CA"
 },
 {
  "name": "Kirk Creek Trail #4E17",
  "description": "Starting across Highway 1 from the Kirk Creek Campground, this trail offers the amazing traditional views of Big Sur. The first couple miles are exposed along the hillside with a complete 180-degree view of the coastline. If done during the day in the warmer months, make sure to pack plenty of water and wear sunblock. It is a grassy area, so be mindful of ticks and poison oak. The first mile is all incline and switchbacks on dirt with grass to either side. It definitely sets the tone and warms your legs up. After the first mile, you're a good way up the side of the hill and it flattens out mostly. Right around the third mile or so, the trail ditches the coast and makes its way into the hills. It is at this point that the tree cover begins to take over. \r\n\nWe did not venture that deep into the trees... we made it to the Vicente Flat campground which is 6 miles in on the trail, and then decided to go back to the third mile where there was a nice wide open grassy area with a ridiculous view of the coast and outgoing sunset. \r\n\nFrom our campsite, if you continued to follow the Kirk Creek Trail to the campground, it takes you into the canyon covered by trees the whole way, where the Vicente Flat campground branches off to the left. The trail continues on past Vicente Flat deep into the Los Padres National Forest. We had one day to do this really, hence our decision to set up shop on the hillside overlooking the coast.",
  "location": "King City, CA"
 },
 {
  "name": "Table Mountain Trail",
  "description": "The trail starts at the metal gate on Shell Road. It loosely parallels Shell Road for about a mile skirting some of the green meadows on the west side of the road. Cross the road and start heading uphill toward the flat mountain right in front of you. \r\n\nThe ascent is initially moderate but then turns into very steep boulder climbing at 1.4 miles. Just continue uphill until you reach the flat surface. Table Mountain provides stunning views of New Melones Lake and the wildflower covered top invites you to just stroll and explore.",
  "location": "Jamestown, CA"
 },
 {
  "name": "Aimee's Loop",
  "description": "We needed more beginner friendly trails, so we built this loop and named it after my wife. Fun and rolling by itself, It  also acts as the hub connector to the Mifflin Loop and Jane's Loop via the carcass cutoff. Bring the kids out and let them run around on this for awhile before taking them to the upper loops.",
  "location": "Tehachapi, CA"
 },
 {
  "name": "Mifflin Loop",
  "description": "It only seems fitting that one of the best trails out here get's named after Craig Mifflin. He cut most of this trail by himself. There are a few little bridges and narrow rock/tree gaps to maneuver through. Stop for a snack and soak in the views from the top of the canyon. Keep left toward the bottom for a rocky section or stay to the right for a smoother downhill finish.",
  "location": "Tehachapi, CA"
 },
 {
  "name": "Jane's Loop",
  "description": "This loop is fun in either direction, so make sure you try it both ways. Great views from the east facing slopes overlooking the Lehigh quarry, mining operation, and a huge open meadow. There are beautiful mature oaks and flowers are plentiful in spring. There is a bit of exposure as it was mostly bench cut into the hillside. Please stay on the trail. Have fun!",
  "location": "Tehachapi, CA"
 },
 {
  "name": "Peoria Flat Road",
  "description": "The dirt road starts behind the locked gate and follows the outline of Table Mountain. It gently ascends and descend as it makes its way to the southern tip of New Melones Lake. Excellent views of the lake are abundant.",
  "location": "Jamestown, CA"
 },
 {
  "name": "NICA",
  "description": "Easily accessible from the Jane's Loop and Warrior Loop, this latest addition to the TMTA/Lehigh Trails system is another fun and rolling one. A series of downhill banked turns really emphasize this aspect of the trail.\r\n\nThe new connector on the last part of this trail is a bit rough at the moment (9/2016) but it's a work in progress. It will get better over time and as it gets used more.",
  "location": "Tehachapi, CA"
 },
 {
  "name": "John Bull Loop Trail",
  "description": "This trail branches off the Coast to Crest Trail about 2.5 miles from the Campo Seco Staging Area. Pass the cattle gate and follow the wide trail as it gently descends towards Lawry Gulch. Cross the dry creek and start ascending again. After about 1 mile, the trail turns sharply right, to your left is a short spur trail that leads to an excellent viewpoint. \r\n\nContinue around the southern flank of John Bull Peak. When you reach another cattle gate at 1.6 miles, there is another spur trail that leads right to the top. Continue ahead through the gate. Make another right turn at 2 miles onto a very wide and rough cattle road. Keep on following the road until you rejoin the Coast to Crest Trail at 2.5 miles.",
  "location": "Valley Springs, CA"
 },
 {
  "name": "John Bull Peak Spur Trail",
  "description": "Head west just before the cattle gate and follow the initially faint trail. Once past the first trees, the trail becomes more obvious. Hike up and around John Bull Peak until you reach the top. There is a picnic table right on the top from where you have spectacular views in all directions, in particular of Pardee Reservoir to the west.",
  "location": "Valley Springs, CA"
 },
 {
  "name": "Mokelumne Coast to Crest Trail",
  "description": "The Coast to Crest Trail section that heads west towards Hogan Lake. This is an excellent place for trail running, hiking and horseback riding.\r\n\nA permit is required to use this trail and there is self registration at the trail heads.\r\n\nYou can find more information about the route here.",
  "location": "Jackson, CA"
 },
 {
  "name": "Lodi Lake Wilderness Trail",
  "description": "Land Manager:  City of Lodi - Parks, Recreation & Cultural Services",
  "location": "Woodbridge, CA"
 },
 {
  "name": "Golden Canyon Trail",
  "description": "This trail through the Golden Canyon and the Zabriske Point badlands offer some of the best hiking in Death Valley National Park.\r\n\nThe trail begins at the Golden Canyon Trailhead accessed off Badwater Road just 3.5 miles south of the Furnace Creek Visitor Center. There is an interpretive trail guide available for Golden Canyon at the information kiosk at the trailhead. \r\n\nThe canyon is true to its name, carved through golden yellow sediments which were deposited at the bottom of Lake Manly over 5 million years ago. The different color bands seen in the walls signify the presence of different minerals. The trail ascends the canyon on a gentle climb for the first mile of the hike. A sign post for Zabriske Point will indicate where the trail climbs out of the canyon and into the Zabriske Point badlands. The Upper Golden Canyon Trail - Red Cathedral Access can be used to get close-up views of the Red Cathedral which looms above Golden Canyon. \r\n\nThe trail ascends steeply out of the canyon as it winds through the Zabriske Point badlands and around the base of the Manly Beacon. The trail begins its descent at 1.5 miles to the first intersection with Gower Gulch where the Gower Gulch Loop Connector trail allows for shorter loop hike to Gower Gulch. The trail to Zabriske Point continues up through the badlands with additional opportunities for beautiful views as it ascends. \r\n\nThe trail again meets Gower Gulch and the intersection with the Gower Gulch Trail at 2 miles. The Gower Gulch Trail can be taken back to the Golden Canyon Trailhead. Keep following the signs to Zabriske Point. The trail will reach the parking area at Zabriske Point where the paved Zabriskie Point Access Trail offers an excellent overview of the canyons and badlands you just ascended through.\r\n\nNeed to Know \nDrink plenty of water: Drink at least one gallon (4 liters) of water per day to replace loss from sweat, more if you are active. Fluid and electrolyte levels must be balanced, so have salty foods or \"sports drinks\" too.\r\n\nAvoid travel in the heat: Do not hike in the low elevations when temperatures are hot. The mountains are cooler in summer, but can have snow and ice in winter.\r\n\nTravel prepared to survive: Stay on paved roads in summer. If your car breaks down, stay with it until help comes. Carry extra drinking water in your car in case of emergency.\r\n\nWatch for signs of trouble: If you feel dizzy, nauseous, or a headache, get out of the sun immediately and drink water.",
  "location": "Badwater, CA"
 },
 {
  "name": "Gower Gulch Trail",
  "description": "The route from Gower Gulch back to the parking area is gradually downhill offering tight canyon narrows near the canyon mouth where a 25ft (7.6m) dryfall is bypassed on its north side. Minor rock scrambling is necessary to complete the entire route as you climb over and down 4ft (1.2m) ledges.\r\n\nUtilizing the Golden Canyon Trail and the Gower Gulch Loop Connector, one can make various loops ranging from a couple miles to +6 miles.\r\n\nNeed to Know \nDrink plenty of water: Drink at least one gallon (4 liters) of water per day to replace loss from sweat, more if you are active. Fluid and electrolyte levels must be balanced, so have salty foods or \"sports drinks\" too.\r\nAvoid hiking in the heat: Do not hike in the low elevations when temperatures are hot. The mountains are cooler in summer, but can have snow and ice in winter.\r\nTravel prepared to survive: Stay on paved roads in summer. If your car breaks down, stay with it until help comes. Carry extra drinking water in your car in case of emergency.\r\nWatch for signs of trouble: If you feel dizzy, nauseous, or a headache, get out of the sun immediately and drink water or sports drinks. Dampen clothing to lower body temperature. Be alert for symptoms in others.",
  "location": "Badwater, CA"
 },
 {
  "name": "Boy Scout Trail",
  "description": "From the southern trailhead, where there is a backcountry board, sizeable parking lot, and bathrooms (but no water) the trail goes north, descending gradually through a classic Joshua Tree forest. After about 1.2 miles, there is a side trail to Willow Hole, which is nice, but not amazing. If you stay on the main trail, it continues through the J-Tree forest until it starts to descend more quickly though monzogranite boulder piles that are typical of the northern edge of the park between the towns of Joshua Tree and 29 Palms. \r\n\nThe last mile or so drags on a little bit, as you can see town, but as there are few markers, distances can be deceptive so you don't know how far you have to go to get to the northern parking lot (no water or bathrooms, much smaller than southern parking lot). I recommend doing this with two cars shuttling, as opposed to an out and back.",
  "location": "Joshua Tree, CA"
 },
 {
  "name": "South Lykken Trail",
  "description": "You can take the trail from the north or south, but be careful NOT to park in the Tahquitz Canyon Visitor Center parking lot unless you pay to go on the Tahquitz Canyon trail. Parking on the north side is found east of the trailhead, along West Mesquite Ave. If you park on the south side, you can park next to the trailhead along South Palm Canyon Drive. Obviously, read and obey all street parking signs.",
  "location": "Palm Springs, CA"
 },
 {
  "name": "California Riding and Hiking Trail",
  "description": "The trail is best taken from west to east so that there is a net descent rather than a net ascent. The first part of the trail is very sandy with an uphill making for a difficult ascent, but once you reach the highest point on the trail of about 5200 ft, do not get your hopes up because you'll be going up and down a lot more with more climbs and descents. \r\n\nIMPORTANT: The trail marker at the junction between Upper and Lower Covington Flat citing the distance to Keys View Rd as 7 mi is incorrect, it is actually about 9.5 miles to Keys View Rd. The most difficult descent of the trail lies between 10.5 and 12.5 miles where there is steep descending and a few switchbacks on a vegetation rich part of the trail; pants are advised over shorts. If stashing water for an overnight trip, a good location is Keys View Trailhead near Juniper Flats Parking Area to California Riding and Hiking Trail Connector because it is almost exactly halfway on the trail. For camping, though, plan on either camping before picking up water so that you do not camp near the road or a few miles after at either Ryan Campground or further. \r\n\nYou'll not see many people on the trail except near the trailheads and Backcountry Boards. After passing Ryan Campground, you'll remain in Juniper Flats until you go through a mountain pass which involves about 200 ft of very light and gradual climbing. When going through the pass, you'll hike near a rusted water pipe, which you cross over a few times as well. This pipe is probably what was used to pump water 3.5 miles from the spring at Ryan Ranch to the local mine. \r\n\nThe hike is then extremely flat with a slight downhill which will take you until about the 30-mile mark, at which point you turn left after crossing Pinto Basin Rd and crest over until you begin to see into 29 Palms. The trail then runs parallel to Pinto Basin Rd until you cross over a small one-lane paved road just after the 33-mile mark. Then the trail makes a hard right to go around a small hill, and the trail becomes overgrown with green vegetation, but there are trail markers with arrows showing the way to go. \r\n\nAfter going around the hill, the trail runs parallel to Park Blvd and along the trail, there are manhole covers with a label reading High Voltage, Southern California Edison. Depending on the season, the trail is then bombarded with large caterpillars, so watch your step. The trail then makes a right, and you reach the end of the trail.",
  "location": "Yucca Valley, CA"
 },
 {
  "name": "Antelope Trail South Loop",
  "description": "Land Manager:  California State Parks - Tehachapi District",
  "location": "Green Valley, CA"
 },
 {
  "name": "Ubehebe Peak Trail",
  "description": "Hike and scramble to the top of Ubehebe Peak for unending views. This area is a super remote and magical place and there's a good chance you'll have the summit (and maybe the entire valley) to yourself. There is no water nearby so pack your own. \r\n\nThe trail begins at the parking area across the dirt road from the Grandstand sign. It'll start up the slope gradually and then turns into some narrower switchbacks as you climb up to the saddle. Once there, you'll have views into the Saline Valley to the west. Continue up the trail, following cairns if needed (the trail is fairly easy to follow). You'll circle around the west side of the ridge and then back toward the playa. \r\n\nOnce back on the ridgetop, you can head north (left) and tag the lower two peaks. To get to Ubehebe, head south (playa to your left) and drop down on the west side of the ridge again. Follow the boot path and cairns up and scramble as necessary. It's pretty hard to lose your way - just head up!",
  "location": "Lone Pine, CA"
 },
 {
  "name": "Sidewinder Canyon",
  "description": "The trailhead is at the end of a 0.5 mile (0.8 km) long gravel access road (typically passable to a sedan) off Badwater Road 31.5 miles south of CA-190 between mile markers 31 & 32. There is a small sign at the start of the access road. This is also the trailhead for the Willow Canyon hike. There are no amenities, no shade, and no water at this trailhead. Bring sun protection and plenty of water with you.",
  "location": "Badwater, CA"
 },
 {
  "name": "Huckleberry Path",
  "description": "Huckleberry Path is the primary loop trail for exploring this parkland. Huckleberry Botanic Regional Preserve has a very unusual microclimate and very unusual soils, so it is home to some rare plants. The two primary access points are from the Preserve's parking lot, on Skyline Blvd between Grizzly Peak Blvd and Snake Road, and from the park's south end at the junction of Skyline Blvd and Pinehurst Road. \r\n\nIn order to get maximum enjoyment of the park and its rare plants, pick up a brochure at the parking lot's signboard or download it from the park's website. \r\n\nThe brochure describes the following route: From the parking lot's signboard, continue along a connector trail to reach this trail (Huckleberry Path) at a junction. Here, turn down to the left and descend steeply to another junction. \r\n\nThis trail (on the lower part of its loop) continues up and to the right. On this part of the trail, you'll pass a connector trail that goes steeply uphill. Continue ahead on this trail, reaching a junction. (Here, the trail can be followed to the left to reach the south end of the park.) Turn sharply to the right. You'll now be on the upper part of the loop, which contains most of the unusual plants and, after an initial steep climb, is mostly flat.\r\n\nSoon, you'll pass the top of the previously-passed connector trail, which drops down to the right, then two additional connector trails going to the right. Continuing, you'll return to the junction near the parking lot.",
  "location": "Moraga, CA"
 },
 {
  "name": "Indian Cove Trail",
  "description": "The trail has a magical quality to it. You start at the top of the ridge and hike through beautiful trees.",
  "location": "Castro Valley, CA"
 },
 {
  "name": "Volcanic Trail",
  "description": "You can enjoy views of Siesta Valley, which were formed by volcanic activity in the area. The trail is part of the self-guided tour of Round Top, and contains several stops to view geological formations.",
  "location": "Orinda, CA"
 },
 {
  "name": "Cascade Trail",
  "description": "This gently graded trail provides wonderful views of canyon and (in season) a cascade. The high end of this trail is at Stone Bridge, where this trail meets the Jackson Grade, Brandon Trail, and Grass Valley Trail. Follow this narrow trail downhill from the west end of the bridge (next to a bench). The trail winds gently downhill through mixed forest and soon offers a view of a cascade (when water is flowing in the stream). Continue downhill, winding in and out of canyons. When you reach the Columbine Trail, this trail ends. You can continue in either direction on Columbine Trail.",
  "location": "San Leandro, CA"
 },
 {
  "name": "East Shore Trail",
  "description": "Check the website to see when the swimming area is open.",
  "location": "Oakland, CA"
 },
 {
  "name": "Loggers Loop Trail",
  "description": "The first 0.5 miles of Loggers Loop takes you down into the canyon. Redwoods used to cover this area, but were logged and replace by eucalyptus. Eucalyptus were introduced to California by Australians during the California Gold Rush. The trees have taken over many parks in the East Bay. \r\n\nThe trees protected us the the heat and the aroma was calming. The trail took us uphill 0.6 mile to Brandon Trail. We saw several bushes of sticky monkey flowers along the way.",
  "location": "Ashland, CA"
 },
 {
  "name": "West Shore Trail",
  "description": "Fishing and swimming can be off limits due to algae. Check the website for the current status.",
  "location": "Oakland, CA"
 },
 {
  "name": "Woodrat Trail",
  "description": "This is an enjoyable singletrack trail. It is well shaded with gradual slopes.",
  "location": "Crockett, CA"
 },
 {
  "name": "French Trail",
  "description": "French Trail extends between West Ridge Trail near the northwest end of the park and Orchard Trail near the southeast end. Along the way, it crosses Tres Sendas Trail, Redwood Peak Trail, Star Flower Trail, Madrone Trail, Mill Trail, Fern Trail, and Chown Trail. Trail users will travel along a steep hillside under a redwood canopy on this unique East Bay Trail. The northwest end of this trail, between West Ridge Trail and Madrone Trail, features some significant ascents and descents. Between Madrone Trail and Orchard Trail, this trail \"contours\", not changing very much in elevation. \r\n\nRoute-finding note: this trail's junctions with Tres Sendas Trail, Star Flower Trail, Fern Trail, and Chown Trail have \"offsets\" in which the intersecting trails join together for a short distance–so there are really two junctions at each of these locations. Note the junction posts and their trail name and arrow disks to be sure you remain on course.",
  "location": "Piedmont, CA"
 },
 {
  "name": "Stream Trail",
  "description": "The trail starts at the Skyline Gate Staging Area and follows Redwood Creek through Redwood Regional Park. At 0.4 miles, you pass Girl's Camp and then head across the creek over a wooden bridge. The trail stays north of the creek for a while with Eucalyptus Trail joining at 0.65 miles and Tres Sendas Trail at 0.95 miles. \r\n\nAt this point, you have entered old-growth redwood and walk among some very tall trees. Prince Trail joins on the left at 1.35 miles, Mill Trail on the right at 1.5 miles, followed by Fern Trail at 1.7 miles and Chown Trail at 1.9 miles. You then cross Redwood Creek again and soon reach Trails End. \r\n\nFrom this point on, the trail is paved and wheelchair accessible. You leave the redwood grove at 2.5 miles and enter more open land. Cross Redwood Creek one more time before you reach the Canyon Meadow Staging Area.",
  "location": "Piedmont, CA"
 },
 {
  "name": "Hoot Trail",
  "description": "A manageable climb up a mix of single and doubletrack brings you to the top of the newer and increasingly popular Hoot Trail. \r\n\nFrom the top, it's 100% singletrack down to Rock Creek Road. Right off the bat, the trail gets going through the forest with switchbacks down the north side of the ridge.\r\n\nPark at the Harmony Market and enjoy the Hoot Trail, Scott's Flat Lake Trail, Pioneer Trail and many more! Then stop by the 5 Mile House or Harmony Market to refuel your stoke!",
  "location": "Nevada City, CA"
 },
 {
  "name": "Gold Valley Rim Trail",
  "description": "New in 2017, Gold Valley Rim Trail extends from Packer Saddle north to Gold Valley OHV Trail, aka “Baby Heads”, via nearly three miles of the recently decommissioned Pacific Crest Trail (PCT) and two new miles of singletrack. \r\n\nThis new singletrack alignment bypasses the Forest Service 93-3 road that connects Sunrise Trail with \"Baby Heads\", a notoriously rocky doubletrack descent, and is a great alternative for accessing Pauley Creek OHV Trail (11E03) or Big Boulder trails. Gold Valley Rim Trail offers majestic ridgetop views of the Sierra Buttes, Mount Elwell, Packer Lake, and Deer Lake. \r\n\nPick up the trail at Packer Lake Saddle (intersection of County Route 621 and Butcher Ranch Rd.), just a short distance from the shuttle drop off at the top of Sunrise Trail. \r\n\nThe trail starts with a gradual climb to obtain the ridge where you are rewarded with sweeping views of the Lakes Basin. After hiking along the ridge, the trail crosses a couple small service roads where it then deviates from the old PCT and begins to drop down toward \"Baby Heads\" on new singletrack. The descent is on par with the many great descents in the Downieville trail system with plenty of rocky technical sections. \r\n\nThe trail crosses over several sections of rock slab that gives you a little taste of Moab hiking, Sierra style. \r\n\nThe trail ends at an intersection with Forest Service Road 93-3. Follow signs straight to continue on to \"Baby Heads\" and the start of Pauley Creek/Big Boulder trails, or, turn left on Rd. 93-3 and hike about 3.5 miles back to pick up the start of Butcher Ranch Trail.",
  "location": "Downieville, CA"
 },
 {
  "name": "Upper Mills Peak Trail",
  "description": "This hike starts atop right near the Mills Peak Fire Lookout. The trail begins by heading south, but soon doubles back and zigzags across the ridge in a general northern direction. The trail descends down a fairly consistent moderate grade. There are a few switchbacks along the trail that help to ease the grade.\r\n\nJust about four miles in, the trail ends at an old 4x4 jeep track. You can take this north to reach Middle Mills Peak Trail",
  "location": "Portola, CA"
 },
 {
  "name": "Smith Creek Trail",
  "description": "This trail takes off from the Smith Lake Trail just east of the north end of the Mt. Elwell Trail. If descending the Mt. Elwell Trail, you can take a right on Smith Lake Trail to quickly reach the start of this singletrack.\r\n\nThe trail descends along the left side of Smith Creek down a steady grade. Near the bottom you'll intersect the Gray Eagle Connector on the right. Stay left to continue down to the end of the trail. From there, retrace your steps or head right to wind your way out on fire roads that descend to Graeagle.",
  "location": "Clio, CA"
 },
 {
  "name": "Sierra Buttes Trail #12E07",
  "description": "From the Pacific Crest Trail, continue straight up the ridge with Sierra Buttes ahead of you. The ascent is moderately strenuous as you make your way up to the top. At about 0.6 miles, you get an excellent view of Young America Lake just below you. As you continue further, the trail zigzags up steeply. At 1.1 miles, you reach a fairly washed out dirt road (Sierra Buttes OHV Trail #12E07). Follow the road farther up until you reach the lookout tower.",
  "location": "Downieville, CA"
 },
 {
  "name": "Butcher Trail",
  "description": "This trail continues from Sunrise Trail. Expect loose rocks, creek crossings, tight switchbacks, and a few more rugged sections. \r\n\nJust after the final descent, you'll cross a bridge over a creek and begin a doubletrack climb. In the last 1/4 mile of that climb, the Second Divide trail goes left and down, while the Third Divide (and main trail) goes right and continues up. The Second Divide is longer, but in my opinion, not as much fun as the Third Divide. Both Second Divide and Third Divide lead to the First Divide trail.\r\n\nThis is a popular trail with mountain bikers so be aware of your surroundings and other users on the trail.",
  "location": "Downieville, CA"
 },
 {
  "name": "Big Boulder",
  "description": "This trail is made up of two distinct portions, the climb and the downhill.\r\n\nBegin this hike with a ascent up a doubletrack from the Pauley Creek intersection to the top of the ridge where Big Boulder trail starts. Some sections are pretty steep, some are loose, some are both.\r\n\nOnce you get to the top of the ridge, continue onto the Big Boulder Trail. You'll begin a well-earned descent here. The trail is mostly smooth though a little rugged in places and it weaves through exposed sections and the woods.  \r\n\nThis trail ends at the intersection with Third Divide Trail.",
  "location": "Downieville, CA"
 },
 {
  "name": "Upper Pioneer Trail",
  "description": "Start from either end or continue from Lower Pioneer Trail. There is parking available at the west end at Omega Rest Stop (no water but picnic tables and pit toilets) or the east end at the dirt parking area on Zeibright Road in Bear Valley just off Highway 20.\r\n\nIf starting at Bear Valley, follow Zeibright Road (gravel) west to a split (dirt) that goes right then under the water flume. The trail starts to the right about 75 feet beyond the flume. From there, it climbs old abandoned roads and great sections of new singletrack for a few miles to reach the top with views overlooking Bear Valley along the way. \r\n\nIf starting at the Omega Rest Stop, cross Highway 20 and look for a short connector to Pioneer Trail. It's a little confusing since there is a moto trail that runs parallel in this area. Pioneer Trail is just a few yards further into the forest beyond the moto trail. Just continue perpendicular to Highway 20, cross the moto trail and you'll hit Pioneer Trail. \r\n\nTurn left onto Pioneer Trail for this segment (Upper Pioneer Trail) or right for Lower Pioneer Trail that will take you to White Cloud and Harmony Market (or to Nevada City via Miner's or Snow Ditch Mountain Trails).\r\n\nUpper Pioneer Trail has a few rocky sections and one small creek crossing with no bridge at Steephollow Creek - a year-round water source to filter. It's common to see bears along this trail later in the afternoon, especially around Steephollow Creek and Lowell Hill Road crossings. This segment is 98% singletrack and is signed well. It does cross a few moto trails around Omega and Excelsior Road. There are tons of logging roads and singletrack trails, including moto trails, up here to add to your hike!\r\n\nIn the fall, this hike is often dusty in spots, but perfect after the first rains soak in. There's considerable debris, some fallen trees, and a few small stream crossings in the spring. Occasionally there are horses on the trail, including a few rather large gatherings each year that are usually posted at trailheads in advance. The higher you go on Pioneer, the quieter and more challenging it gets. You haven't really seen Pioneer Trail until you've included the upper sections!",
  "location": "Nevada City, CA"
 },
 {
  "name": "South Yuba Trail: Edwards Crossing to Purdon Crossing",
  "description": "This is a narrow trail following the South Yuba River. It should be broken down in two parts. The section between Round Mountain Trail and the Purdon Bridge is narrow and the climbs can be steep at times, but it is not too rugged. The trail is quite smooth and not right on the edge of the canyon. \r\n\nThe section between Round Mountain and Edwards Crossing Bridge, on the other hand, can be quite dangerous in places. It is sometimes very narrow right on the edge of a vertical drop into the canyon with no room for mistakes and there are a few rocky sections. It offers the very best views of the South Yuba River's steep canyon.",
  "location": "Nevada City, CA"
 },
 {
  "name": "Codfish Creek Discovery Trail",
  "description": "This is an easy trail in an Auburn Recreation Area that begins at Ponderosa Bridge then follows the beautiful scenery of the North Fork American River. The trail then cuts away from the river to follow alongside Codfish Creek which takes visitors to the end of the trail. It's worth working your way all the way to the end of this trail, as the end brings a beautiful surprise, Codfish Falls. \r\n\nThe falls are a great place to take a break before heading back along the same route to the trailhead. At the falls, there is access to fishing (check regs) and swimming.",
  "location": "Meadow Vista, CA"
 },
 {
  "name": "Upper Yosemite Falls",
  "description": "Pets, bicycles, and strollers are prohibited. Do not shortcut switchbacks, which causes rapid trail erosion and results in injuries. Keep your food within arm's reach at all times and do not feed the wildlife. Carry out all trash and food waste (fruit peels, shells, etc.).\r\n\nThe Valley Visitor Shuttle (7 am to 10 pm year-round) serves the trailhead area. Ride the shuttle to stop #7 and walk directly across the street to Camp 4 and follow trailhead signs. You can also ride the El Capitan Shuttle (9 am to 6 pm) to Camp 4 (stop E2) from late May through early October.",
  "location": "Yosemite Valley, CA"
 },
 {
  "name": "Mist Trail",
  "description": "Follow the Mist Trail for 0.5 miles (0.8 km) from the junction with John Muir Trail up a steep granite stairway of over 600 steps. Prepare for slippery footing and a tremendous amount of waterfall spray in spring and early summer (hence the name for this trail!). You'll delight in views of Vernal Fall all along this stretch of trail and may even be able to see a rainbow in the spray of the fall. At the top of Vernal Fall, you can experience jaw-dropping views straight down the length of the 317-foot waterfall (please don't cross the railings and use extreme caution while you're near any flowing water or wet rock in this area). \n\nFrom this point, you can: choose to turn around and head back the way you came; continue up to the next junction (about 0.2 miles / 0.3 km) and take the longer route back via the John Muir Trail; or continue uphill on the Mist Trail to the top of Nevada Fall. If you choose to continue on the Mist Trail, shortly beyond Vernal Fall, you'll pass by Emerald Pool and Silver Apron. Both of these may look inviting on a hot summers day, but it is illegal and dangerous to swim here due to the extremely hazardous current. \n\nContinuing along the Mist Trail, youll experience another 1.5 miles (2.4 km) of steep, rocky switchbacks in order to reach Nevada Fall. Crashing down 594 feet, this thunderous waterfall is fullest in spring and early summer, and you'll find terrific photographic opportunities along this stretch of trail. The trail ends at another junction with the John Muir Trail.",
  "location": "Yosemite Valley, CA"
 },
 {
  "name": "Four Mile Trail",
  "description": "This trail begins near the base of Sentinel Rock and climbs to the top of Yosemite Valley at Glacier Point. The trail maintains a continuous steep grade, following the path of an old toll trail that was completed in 1872. The trail has changed a bit over the years; it is now closer to five miles than four (and of course there is no more toll). Spectacular views of Yosemite Valley, El Capitan, Yosemite Falls, and, eventually, Half Dome await those willing to tackle this strenuous trail. Don't skip the side trip to enjoy the view of Yosemite Valley from Union Point, located a bit over two-thirds of the way up.\r\n\nThe Four Mile Trail ends at Glacier Point, where restrooms, parking, and a snack stand (summer only) are available. You can choose to hike back to Yosemite Valley by reversing your route or by continuing on the Panorama Trail, which brings you to the Happy Isles Trailhead in another 8.5 miles (13.7 km).\r\n\nIf you want to hike one way, make sure you have another member of your party available to drop you off or pick you up at the other end. There is no free shuttle system between Glacier Point and Yosemite Valley. The park concessioner runs three daily guided bus tours that include a stop at Glacier Point can purchase a tour bus ticket from any tour desk to ride the bus to Glacier Point (hiking back to the Valley). You should purchase this ticket in advance to guarantee your space, but advance tickets are only available if riding the bus from Yosemite Valley to Glacier Point. There is no way to guarantee space riding from Glacier Point to Yosemite Valley; tickets in this direction can only be purchased in cash from the bus driver if space is available.\r\n\nSeasonality: \nThe Four Mile Trail typically opens for the season sometime in May and closes below Union Point due to treacherous conditions after significant snow accumulation (usually by November or December). After major snowfalls, the entire trail may close. When partially closed, only the lower three miles (5 km) are open to the gate below Union Point; good views of Yosemite Valley are still possible, although Glacier Point and Union Point would not be accessible. This lower section is also very icy and slippery during winter and early spring.",
  "location": "Yosemite Valley, CA"
 },
 {
  "name": "Moro Rock Trail",
  "description": "The Moro Rock trail starts at the Giant Forest Museum. You can park across the street in the Big Trees Trail parking lot and hike across the road. You can visit the museum and gift shop before you start your hike.  \r\n\nHike along the road toward Moro Rock and on the right side of the road, you'll see the Moro Rock Trail sign. It is a singletrack dirt trail that meanders through the forest. As you make your way along the trail, you can see Giant Sequoias all around you. These giants tower above the trail and provide shade throughout the day, which makes it a great hike no matter what time of day.   Because of the elevation, it is cooler in the forest than it is in the foothills.  \r\n\nWhile the trees provide shade and your gaze is drawn to the giants that tower above you, don't forget to look at the ground. You can see sequoia cones that have fallen from the tree, both new and old ones that have fallen over the years. Around 1.25 miles, the Bear Hill Trail joins the Moro Rock trail from the left hand side.  At 1.4 miles, the trail forks. You can go to the right and follow a short trail that goes out to a viewpoint where you can see Moro Rock, and it is good for sunsets as well. Continuing straight, the trail crosses the road and climbs shortly above the road. \r\n\nThe Soldiers Trail breaks off the the left at 1.6 miles. The trail descends to the Moro Rock parking area. From here, the trail climbs steeply up Moro Rock via stone steps. There are great view points on the way to the top of the rock. You get great views of the foothills to the West and the Western Divide (which is to the east). Once you have enjoyed the views, you can continue following any of the trails in the area to extend your day hiking among the Giant Sequoias, or follow the trail back to your car.",
  "location": "Three Rivers, CA"
 },
 {
  "name": "Tokopah Falls Trail",
  "description": "The Topokah Falls Trailhead begins inside Lodgepole Campground. Inside the campground, follow the signs for the trailhead. The trail itself is well-worn and well-maintained. The trail is approximately 1.9 miles one-way, from trailhead to the waterfalls, with a constant gradual incline towards the destination. The trail follows a river within a forest and eventually goes through a rocky area with huge boulders. Once you get to this rocky area, you'll know that you are close to the waterfalls. Once you get to the end of the trail, relax and enjoy the views of the waterfall before heading back downhill towards the trailhead.\r\n\nBug repellent is a must, along with sunscreen and water.",
  "location": "Three Rivers, CA"
 },
 {
  "name": "Panorama Trail",
  "description": "This longer route to Yosemite Valley brings hikers past Illilouette, Nevada, and Vernal Falls. After descending 1,300 ft (400 m) to Illilouette Fall during the first 2.0 miles (3.2 km), the trail climbs nearly 800 ft (240 m) to gain the Panorama Cliff ridgeline. Next, a 600 ft (175 m) descent leads you to the intersection with the John Muir Trail above the top of Nevada Fall. You now have two choices to reach Yosemite Valley: a left turn follows the John Muir Trail downhill for the remaining 3.3 miles (5.3 km), while a right turn crosses the brink of Nevada Fall before passing Vernal Falls en route to Yosemite Valley over 2.9 miles (4.7 km). Consider combining this trail with the Four Mile Trail for a long, strenuous loop!",
  "location": "Yosemite Valley, CA"
 },
 {
  "name": "Half Dome Trail",
  "description": "You'll find Half Dome Trail at the intersection with John Muir Trail: Happy Isles to Half Dome Trail, ~6 miles from the Happy Isles trailhead. The trail steadily climbs to the north-northwest through the forest for roughly a mile before turning west and then southwest toward Half Dome. You'll eventually emerge from the tree-cover onto solid granite and begin ascending a steep series of switchbacks to a saddle below the cables.\r\n\nThe most famous--or infamous--part of this trail is the ascent up the cables. The two metal cables allow hikers to climb the last 400 feet to the summit without rock climbing equipment. Since 1919, relatively few people have fallen and died on the cables. However, injuries are not uncommon for those acting irresponsibly.\r\n\nThe .Half Dome cables usually go back up the Friday before Memorial Day (conditions permitting) and come down the day after Columbus Day.\r\n\nTips while using the cables:Take your time and be patient with slower visitorsConsider bringing used cycling gloves or gloves with traction to protect your hands. There will be a pile of used gloves at the base of the summit.Allow faster moving traffic to pass you (when possible)Remain on the inside of the cablesDo not attempt the ascent if:Storm clouds are in the areaThe ground is wet (the cables and rock become very slick when wet; most accidents on the cables occur during wet conditions)You are not wearing sturdy shoes or hiking bootsThe cables are down for the winter (typically, from the day after Columbus Day until Memorial Day weekend) (Check conditions update for status and any available updates)",
  "location": "Yosemite Valley, CA"
 },
 {
  "name": "High Sierra Trail",
  "description": "The High Sierra Trail (HST) is an epic 73 mile trek across the sierras ending with a Mt. Whitney summit. The High Sierra Trail begins at Crescent Meadow in Sequoia National Park then heads up the canyon of the Middle Fork of the Kaweah River, past the majestic beauty of Hamilton and Precipice Lakes, and then traverses the Great Western Divide at Kaweah Gap 10,700 feet. The trail then descends into the beautiful Big Arroyo before  beginning a steady climb up to the Chagoopa Plateau. \r\n\nOnce again the hiker will lose hard gained elevation and drop down over 3,000 feet into the Kern River Canyon. While in the Kern River Canyon, sore-footed hikers will enjoy the natural hot spring tub alongside the mighty Kern River. The trail then continues up the bottom of the Kern Canyon and turns east, climbing parallel to Wallace Creek and merging with the John Muir Trail Segment 7, 49 miles from the starting point. Once on JMT Segment 7, the hiker can then follow the John Muir Trail about 13 more miles  to the summit of Mount Whitney. With Whitney bagged, most hiker will continue the remaining 12 miles downhill to Whitney Portal to complete the trail.",
  "location": "Three Rivers, CA"
 },
 {
  "name": "Duck Pass Trail",
  "description": "Climbing over Duck Pass to join the John Muir Trail, the Duck Pass Trail starts on a forested hillside behind Coldwater Campground and goes past Arrowhead, Skelton, and Barney Lakes before going over Duck Pass. A side trail to Emerald Lake offers an alternate route to Skelton Lake. Common destinations beyond Duck Pass include Duck Lake, with an intense, deep-blue color, and nearby Purple Lake.\r\n\nA true gem of the John Muir Wilderness, Duck Pass Trail is a must-do and won't be forgotten for a long time.",
  "location": "Mammoth Lakes, CA"
 },
 {
  "name": "Pohono Trail",
  "description": "Hikers can access the southern rim of the Valley with destinations like Bridalveil Creek and Taft Point from the Wawona Tunnel or Glacier Point. This trail travels west along the south rim of the Valley, leading to beautiful vistas, such as Sentinel Dome, Taft Point, Dewey Point, and Inspiration Point.\r\n\nPohono is perfect for those interested in hiking a trail with fewer people AND stunning views. The spectacular peaks of the Clark Range are the backdrop to these vistas.\r\n\nAn optional 0.5 mile (0.8 km) side trail gains the summit of Sentinel Dome after approximately 1 mile of hiking from Glacier Point.\r\n\nMost commonly used as a one-way (downhill) from Glacier Point, the Pohono Trail rewards hikers with several viewpoints of Yosemite Valley from the south rim. East to west, these views include Taft Point, Dewey Point, Crocker Point, and Stanford Point.\r\n\nStarting from Glacier Point, head west on Pohono Trail. From here there is a short rise to an intersection with Sentinel Dome Trail (take that if you're interested in a side trip). From Sentinel Dome, Pohono undulates often, generally trending downhill, however.\r\n\nBypass the intersection at ~2.7mi with Taft Point Connector and continue west. Be sure, however, not to miss Taft Point itself. The views are stunning. From there, only McGurk Meadow Trail and Dewey Point Trail intersect Pohono.\r\n\nOf course, in classic Yosemite fashion, this hike's crescendo culminates at its end - Tunnel View. Even though this trailhead is a crowded parking area it hosts absolutely stunning vistas of the surrounding Yosemite Valley.",
  "location": "Yosemite Valley, CA"
 },
 {
  "name": "Demens Creek Trail",
  "description": "Land Manager:  City of Rancho Cucamonga, CA - Parks, Facilities and Trails",
  "location": "San Antonio Heights, CA"
 },
 {
  "name": "Gale Motorway",
  "description": "Gale Motorway is a very steep, paved road. The road does have some great views, and it is never crowded. Just when you think the top is near, don't worry, there are actually two to three more corners!",
  "location": "Claremont, CA"
 },
 {
  "name": "Topanga Ridge Trail",
  "description": "Land Manager:  NPS - Topanga State Park",
  "location": "Woodland Hills, CA"
 },
 {
  "name": "Craig Regional Park Small Lake Loop",
  "description": "Free parking in State College Blvd. Paid Parking inside the park at a low rate.",
  "location": "Brea, CA"
 },
 {
  "name": "Tree of Life Trail",
  "description": "This is a tough loop with steep climbs and descents on loose dirt. Most visitors will only use this one heading up to the Wisdom Tree or even to the Hollywood Sign by connecting with the Aileen Getty Ridge Trail on the Cahuenga Peak hike.",
  "location": "Hollywood Hills West, CA"
 },
 {
  "name": "Rocky Peak Fire Road",
  "description": "The parking area at the southern end of the trail is small.",
  "location": "Chatsworth, CA"
 },
 {
  "name": "Potato Mountain",
  "description": "Potato Mtn - Wilderness Trail is a 5.8 mile out and back trail located near Claremont, California that offers scenic views. This track is connectable from the Claremont Loop or Marshall Canyon Trail. I understand you can head up Every Canyon as well, but heard you need a pass (free) to get on the trail.\r\n\nThis trail is primarily used for hiking, road biking & trail running. Connecting from Marshall Canyon Trail will provide quite a workout, as it's 8 to 9 miles of climbing. I wouldn't recommend this on a hot summer day as there is little respite from the sun. If coming up the Cobal Canyon - Claremont trail, you're looking at 5 to 6 miles. The trail is all fireroad and not very rocky at all. Additionally, the last dig up to the peak is a pretty good stretch and a bit steep. It's really the only tough section. \r\n\nOnce at the top, the tradition is to leave a spud with your name on it at the concrete cylinder at the peak. Once up there, you'll get some good views of the Pomona Valley and Pacific Ocean on clear days.",
  "location": "San Antonio Heights, CA"
 },
 {
  "name": "Bell View Trail",
  "description": "Bell Peak can be as short or as long of a hike as you want it to be. The climb starts immediately and only gets more challenging as you climb towards the flag-topped peak. Views of south Orange County from the canyon to the ocean are beautiful on a clear day. You can choose to either make the quick hike to Bell Peak or continue all the way to Los Pinos Peak.",
  "location": "Rancho Santa Margarita, CA"
 },
 {
  "name": "Las Llajas Canyon Road",
  "description": "This trail is an easy hike from the parking location to the driveway of the Marr Ranch (private property). Once you reach the windmill, go right if taking the path clockwise. \r\n\nThis is quite the easy hike, if you're willing to do a total of about 7 miles, and this trail is definitely doable for a beginner. Hiking shoes are recommended.",
  "location": "Santa Susana, CA"
 },
 {
  "name": "Redwood Trail",
  "description": "The trail ends just past the creek crossing (in April, it was an easy cross). Also, beware of poison oak throughout the trail.",
  "location": "Deer Park, CA"
 },
 {
  "name": "Marie Creek Trail",
  "description": "A rocky singletrack that parallels the creek. Connects Chaparral Trail with Manzanita Trail.",
  "location": "Green Valley, CA"
 },
 {
  "name": "Mount St. Helena",
  "description": "Very little shade after the first mile. Also rocky terrain in the beginning. Be mindful that there are very few trail posts but they are there.",
  "location": "Calistoga, CA"
 },
 {
  "name": "Table Rock Trail",
  "description": "The trail starts south of the parking lot and zigzags up the hillside to meet a slightly wider trail. At 0.4 miles, you'll reach Bear Rock Overlook on the left, which offers a panoramic view north. Following the trail, you occasionally get a good view towards the south and reach a big labyrinthine pattern laid out of small rocks at about 1.2 miles. The trail descends steeply afterwards and makes a right turn at 1.4 miles. At the end of the final ascent is Table Rock, a big volcanic rock that offers a spectacular view of the surrounding area.",
  "location": "Calistoga, CA"
 },
 {
  "name": "Upper Oat Hill Mine Trail",
  "description": "The Upper Oat Hill Mine Trail follows over the former Oat Hill Mine Road. This road was an important means of transportation between the local town of Calistoga and the Oat Hill Mine, the third largest quicksilver or mercury mine. The mine operated from the early 1870's to the late 1960's. Today, the 8.3-mile road connects Aetna Springs Road and Calistoga. The trail can prove difficult with rocky terrain, but it is open to hikers, mountain bicyclists, and equestrians. \r\n\nThe trailhead for the Upper Oat Hill Mine Trail is along Aetna Springs Road, with limited parking. The entire trail is well-maintained and well-marked, with posts marking every mile. The trail follows along the ridge, with well shaded areas allowing you to meander through the oak and cypress trees above the Napa Valley. The Upper Oat Hill Mine Trail ends at Holm's Place, an old homestead property of Karl Gustov Holm who built a log cabin in 1893. Parts of the stone wall from the barn remain in the area. At this point, the trail meets with the Palisades Trail and the Lower Oat Hill Mine Trail. The Palisades Trail goes north to Table Rock.",
  "location": "Calistoga, CA"
 },
 {
  "name": "Lower Oat Hill Mine Trail",
  "description": "The Lower Oat Hill Mine Trail follows over the former Oat Hill Mine Road. This road was an important means of transportation between the local town of Calistoga and the Oat Hill Mine, the third largest quicksilver or mercury mine. The mine operated from the early 1870's to the late 1960's. Today the road connects Aetna Springs Road and Calistoga. The trail can prove difficult with rocky terrain, but it is open to hikers, mountain bicyclists, and equestrians. \r\n\nThe trailhead for the Lower Oat Hill Mine Trail is on 29 just north of Silverado Trail N. There are only three parking spots, but there is parking available along 29, very close to the trailhead. Starting out, you'll hike around the local vineyards, with a metal fence along your left side. About 0.25 miles along the trail, you'll see your first vista overlook, allowing you to look out upon Napa Valley. About 0.75 miles along the trail, you'll see another vista overlook, with another sweeping view of Napa Valley. \r\n\nThe entire trail is well-maintained and well-marked, with posts marking every mile. From 0.75 miles to 2.33 miles, the trail climbs up to a ridge and then remains relatively even afterward. The Lower Oat Hill Mine Trail ends at about 4.3 miles at Holm's Place, an old homestead property of Karl Gustov Holm who built a log cabin in 1893. Parts of the stone wall from the barn remain in the area. At this point the trail meets with the Palisades Trail and the Upper Oat Hill Mine Trail. The Upper Oat Hill Mine Trail sees seasonal closures. The Palisades Trail goes north to Table Rock.",
  "location": "Calistoga, CA"
 },
 {
  "name": "North Sonoma Mountain Ridge Trail",
  "description": "This trail has a good bit of everything, from thick forest, a creek, rolling hills, steep action up a mountainside and vistas of the beautiful Bennett Valley.\r\n\nYou'll enter in a thicket of trees and soon cross a bridge over South Fork Matanza's Creek. This will spit you out of the shade and straight into very open fields of rolling hills. As you wind your way through these hills, take a few moments to look back and enjoy Bennett Valley's lovely scenery. You'll reach the top of these gentle hills and face steep (but shaded) switchbacks. Once again, there's a gap between the trees so be sure you take a few minutes to really let the beauty of the view sink in. Sonoma truly has its treasures, and the sights here are among my favorites!",
  "location": "Eldridge, CA"
 },
 {
  "name": "Fern Canyon Loop Trail",
  "description": "The Fern Canyon Loop Trail is not to be missed if you are in the area. This short loop trail takes hikers through Fern Canyon, a stunning canyon whose 30-ft walls are lined with ferns. These ferns, which cover the canyon walls, are an ancient species with an ancestry that dates back to nearly 325 million years ago. \r\n\nTo access the Fern Canyon Loop Trail, park at the nearby Fern Canyon parking area off of Davison Road and head north on the Coastal Trail for a short ways before taking the right-hand turn onto the Fern Canyon Loop Trail. The trail starts with a short, easy uphill trek before leveling off in the canyon as you hike along the streambed of Home Creek. There may be some trees along the way that you'll have to climb over or under.\r\n\nThis section of the trail is absolutely stunning, as you hike through an area straight out of prehistoric times. This large canyon is completely covered with ferns -  dark, green sword ferns, velvety five-fingered ferns, and delicate lady ferns. Small sections of the trail are on a boardwalk, and dirt paths meander through this giant canyon.\r\n\nThe trail then climbs out of the canyon to a junction with the James Irvine Trail; stay left to continue on the loop. The trail meanders through equally lush forests to rejoin its start not far from the Coastal Trail.",
  "location": "Westhaven-Moonstone, CA"
 },
 {
  "name": "Lost Coast Trail: North (Mattole - Black Sands Beach)",
  "description": "This trail may be approached from 3 main entry points: at the top of the King Range National Conservation Area, at the middle between the King Range and Sinkyone Wilderness (Needle Rock), or at the southern end of the Sinkyone Wilderness at Usal Campground.\r\n\nThere are many tall ferns, trees, and other plants that overhang the trail the whole time. Keep an eye out for wildlife as well. On this trip, I encountered one ginormous elk, 2 black bears, 2 does, a handful of lizards, and a couple of ticks (one of which left me with a nice bullseye ring, which is most likely onset Lyme disease, so use caution with these guys!).\r\n\nd",
  "location": "Ferndale, CA"
 },
 {
  "name": "Boy Scout Tree Trail",
  "description": "The trailhead will be on the left side of Howland Hill Road and will be well marked. Look for cars parked on the right hand side (north of the road). This is a nice forested path that will take you through some redwoods. Towards the end of the trail will be a set of stairs that leads up to the Boy Scout redwood tree. This behemoth is truly remarkable. The double trunk of the redwood will dwarf any others, and this is a great spot to simply appreciate this incredible tree species. \r\n\nOnce you've seen the Boy Scout tree, you can head back down to the main trail and continue onward a short distance to Fern Falls. The falls have a nice resting spot where visitors can enjoy the waterfall. This is a great place to have snack before heading back to the car.",
  "location": "Bertsch-Oceanview, CA"
 },
 {
  "name": "Tall Trees Trail",
  "description": "Visitors to Redwood National Park frequently come to admire the giant coastal redwoods the call this area home, and the Tall Trees Trail is the perfect trail on which to visit some of the park's giants. An excursion to this trail will take nearly half a day, and the park recommends allotting ~4 hours to reach the trailhead and complete your journey on this trail. The last few miles of driving to this location will be on a winding dirt road. This makes it especially difficult for larger vehicles such as RV's to access the trailhead, and travel isn't recommended for vehicles over 21 feet in length. \r\n\nAfter the scenic drive to the trailhead, you'll park your car near a picnic area and trailhead. From there, two trails will depart, this one and the Emerald Ridge Trail. Take the more northern of the two, and keep right at any intersections. From here, you'll enjoy about 1.5 miles of shady, downhill hiking. There are a few steeper portions of the trail, so use caution on your way down. \r\n\nAt the end of the descent, you'll have reached an alluvial flat. The trail here will split both right and left. You can take either route, as this is a looped portion of the trail. This route heads to the left first, following along Redwood Creek. You'll enjoy a series of boardwalks through this section, which keep your feet dry even when water levels are high. Enjoy this opportunity to get especially close to the water and to observe the full-time residents! \r\n\nAs you continue on your way, the trail will eventually duck back into the trees. It is in this section that the already large redwood forest will show off some of the tallest members of the grove. Take your time to admire the scale of the trees in this portion, as some of them are truly massive! Once you've made your way through the grove, you'll find yourself back at the intersection where you initially turned left. \r\n\nMake another left to begin your 1.5 mile hike back to the car. Note that the elevation that you lost on the way to the grove has to be made up, and you'll be climbing for most of the return trip.",
  "location": "Westhaven-Moonstone, CA"
 },
 {
  "name": "Mendocino Headlands Coastal Trail",
  "description": "This trail is unmarked but easy to find as it traverses the coast line. There are several short trails that extend out to various viewpoints to observe the rugged coast, arches, or to watch the sunset.\r\n\nThe trail runs the length of the park from the north to the south (or vice versa) near the town of Mendocino. You can start the hike from either end and there are several parking areas along the park road so you can check out different sections without hiking the entire trail. Many people use this trail for jogging and watching the sunset. This recent trip, I went early one morning around 6 a.m. for a peaceful and relaxing hike. This is a trail I could walk or run every day. \r\n\nAs you hike the coastal trail, take careful note of the rock formations just off the coastline. There are quite a few arches created by erosion from the waves beating the rocks. Some of the arches are easy to find while others are a little more difficult. Some have to be seen from a certain angle. Others are small but arches none the less. This is the most concentration of arches I've seen along the coast.\r\n\nWhenever I am in Mendocino or Fort Bragg just north on the coast, I make time to visit Mendocino Headlands to watch the sunset. There are so many great location to watch from here. The rocks and cliffs protruding from the ocean make a great foreground as the sun sets on the horizon. This recent trip I found a pinnacle rock with the sun setting behind it. I thought it was very nice.",
  "location": "Fort Bragg, CA"
 },
 {
  "name": "Lost Coast Trail: South (Usal Beach - Morgan Rock)",
  "description": "This trail may be approached from 3 main entry points: at the top of the King Range National Conservation Area, at the middle between the King Range and Sinkyone Wilderness (Needle Rock), or at the southern end of the Sinkyone Wilderness at Usal Campground.\r\n\nTo start at the southern portion, exit on Usal Rd off Highway 1 (this exit is unmarked, use the Hiking Project mobile app). This is located about 20 miles west of Leggett, CA. Once you get to the exit, it takes about 45 minutes to drive the 6 miles to Usal Campground. The dirt road is a single lane that can be extremely steep in places. 4WD may be necessary during some parts of the year so call the local ranger station to check road status before heading out. Be sure that your reverse driving skills are sharp because you may have to drive backwards along this road for a small stretch due to oncoming traffic.\r\n\nOnce at the campsite, pay the $5/night parking fee and start heading along Usal Rd to the north. You'll see a very distinct single-path trail that heads into the Redwoods and up a hillside. There used to be typical trail sign here, but it has since been replaced.\r\n\nRight from the get go, this trail starts off with a good dose of switchbacks and incline. It stays this way for the first mile or so, and then you reach a clearing where you can see Usal Beach down below. From here, its more incline as you climb the mountains that overlook the southern end of The Lost Coast. \r\n\nLittle Jackass Creek is about 7 miles away from Usal. In those 7 miles, you'll cross 3 different creeks (one of which has a small primitive campsite; Anderson Camp). Each one of these has running water in case you need to replenish your water. Every time you cross these creeks, you can expect anywhere from 800-1200 feet in elevation change. There will be some flat portion in between those changes for you to catch your breath. \r\n\nThere are many tall ferns, trees, and other plants that overhang the trail the whole time. Keep an eye out for wildlife as well. On this trip, I encountered one ginormous elk, 2 black bears, 2 does, a handful of lizards, and a couple of ticks (one of which left me with a nice bullseye ring, which is most likely onset Lyme disease, so use caution with these guys!).\r\n\nMake sure you stretch, have plenty of water, eat a big breakfast, have trekking poles handy, and have a big memory card for your camera because this trail demands it. There are so many amazing views once you reach the flat areas of the trail.",
  "location": "Redway, CA"
 },
 {
  "name": "Arcata Ridge Trail: Sunny Brae Section",
  "description": "The Sunny Brae portion of the Arcata Ridge Trail (ART) isn't yet connected to the main portion north of Fickle Hill Road, but it makes for a lovely hike all on its own. \r\n\nClimb the stairs from Margaret Lane next to the water tank, then follow the signs for the ART until you reach the sign marking the part that hasn't been constructed yet. \r\n\nFor much of the way, this trail crisscrosses a wider path/dirt road, and it doesn't really matter which one you hike on, although I'd argue the ART is a nicer trail. \r\n\nOnce you pass the entrance to the one-way downhill trail, though, be sure to keep an eye out for the next left turn marked with an ART signpost, otherwise you'll wind up hiking the Beith Creek Loop instead (which isn't necessarily a bad thing).",
  "location": "Bayside, CA"
 },
 {
  "name": "Coastal Trail: South",
  "description": "Given its length, most visitors will use sections of this trail for out-and-back routes. However, given the parking areas near the start and end, this trail section could be done as a point-to-point shuttle for a long, albeit memorable, day trip. \r\n\nThe start of this trail is tricky to get to. You can either park at the Skunk Cabbage Trailhead, which is ~3.5 miles to the southeast, or you can enter Prairie Creek Redwoods State Park and use the Beach Rd. Parking and Picnic Area which is ~1.3 miles to the north.\r\n\nOnce on the trail, however, you'll marvel at this magnificent stretch of coastline where dense conifer forests tower above the tidal rivers and grasses of the beach. Continue to the north entering Prairie Creek Redwood State Park (if you haven't already) and keep your eyes peeled for whale spouts and regal Roosevelt elk that frequent this area. \r\n\nAt around 4.8 miles from the start, you'll arrive at Fern Canyon. This is a popular spot and for good reason. The trail follows a stream bed with sheer cliff walls on either side that are carpeted in lush green ferns through one of the most extensive redwood ecosystems. Needless to say, this is a must-see. \r\n\nFrom here, the trail extends further to the north just below the coastal cliffs passing the West Ridge Trail and Butler Creek at ~7.5 miles from the start and the Ossagon Trail, camp area, and Ossagon Creek at ~7.75 miles from the start.\r\n\nThe trail continues for another couple miles, ending at Carruthers Cove and the Carruthers Cove Trail.",
  "location": "Westhaven-Moonstone, CA"
 },
 {
  "name": "Bald Mountain Trail",
  "description": "You don't do this trail for hike itself, you come for the views!\r\n\nThis a paved/dirt road (used to service communication towers), so it's not a very nice trail, but the scenery is just spectacular.  It just grinds up and up from the beginning to end; not terribly steep, but without many rests.  Near the top, the road turns left to a communication tower at Red Mountain.  It's not worth the side trip, so take a right on dirt road for the final bit that curves around to the summit of Bald Mountain at 2,729'.  \r\n\nThe summit is certainly one of the best in the bay area: perfect 360 degree views in all directions.  Vineyards, Napa & Sonoma valleys, Berkeley, Oakland, Mt Tamalpais, the SF bay, and even snowy Sierras on a clear day (130 miles)!",
  "location": "Kenwood, CA"
 },
 {
  "name": "Klamath Beach Trail",
  "description": "This is a short and easy trail on a graveled road past one home that transitions into a singletrack graveled path down to the beach. The beach can be very windy and have sneaker waves. Forts made from driftwood can offer shelter. Wildlife is abundant in the river, estuary, beach, and air. The land is managed by the Yurok Tribe of Klamath.",
  "location": "Bertsch-Oceanview, CA"
 },
 {
  "name": "Linda Creek Open Space Preserve",
  "description": "This trail is flat and unpaved, and goes through pretty open space areas that run along Linda Creek.",
  "location": "Citrus Heights, CA"
 },
 {
  "name": "Lakeview Connector Trail",
  "description": "Starting from a fork in the Foresthill Divide Trail, this trail continues downhill along narrow, smooth singletrack with a short climb in the middle and more gradual downhill back to Lower Clementine Rd.  A pretty gentle hike that would be good for the family.",
  "location": "Auburn Lake Trails, CA"
 },
 {
  "name": "Culvert Trail",
  "description": "This is a trail built with jumps, technical sections, switchbacks, high berms, and a CULVERT for mountain bikers to play on. Keep an eye out for bikers moving quickly down this one.",
  "location": "North Auburn, CA"
 },
 {
  "name": "Grizzly Bear Trail",
  "description": "Land Manager:  Auburn State Recreation Area (ASRA)",
  "location": "Auburn Lake Trails, CA"
 },
 {
  "name": "Bridgeview Trail",
  "description": "Land Manager:  Auburn State Recreation Area (ASRA)",
  "location": "North Auburn, CA"
 },
 {
  "name": "Hoosier Bar OHV Trail",
  "description": "Land Manager:  Auburn State Recreation Area (ASRA)",
  "location": "Auburn Lake Trails, CA"
 },
 {
  "name": "Lower Shingle Falls Trail",
  "description": "Leaving Spenceville Road, the trail heads south and immediately passes a large gate. Head up the hill passing the pipeline markers and enjoy the views towards the hills north. After a quarter mile, the trail turns left and heads down the hill again. You reach Dry Creek after 0.8 miles. The trail follows the creek for a bit and then heads north, steeply up the hill again. It ends at the viewing platform for Single Falls (also known as Beale Falls).",
  "location": "Beale Air Force Base, CA"
 },
 {
  "name": "South Fork American River Trail",
  "description": "Starting at Salmon Falls Bridge, ascend to the ridge for views of the area. The hills will keep the trail interesting, not to mention the unbeatable views. About four miles in, the trail winds through trees, abundant with the sound of nature. The trail also connects to the Cronan Ranch and Magnolia Ranch trail systems. \r\n\nThe trail is well defined with no intersections prior to connecting with the Cronan Ranch trail system. Be aware of rocky switchbacks, as it is not hard to catch a toe on the first main climb. After this climb, the trail smooths out with plenty of hills, vistas, and benches. \r\n\nThe trail follows with South Fork of the American River, providing epic views and soundtracks for your time on trail. Poison oak, cougars, and rattlesnakes frequent the area, so caution is recommended. Do not forget your water as much of the trail is exposed to the sun.",
  "location": "Pilot Hill, CA"
 },
 {
  "name": "Sky Ridge Trail",
  "description": "The trail is smooth, recently built with an eye towards mountain biking. The views from the top of the ridge are really wonderful and the burned descent into the forest is exciting.",
  "location": "Pilot Hill, CA"
 },
 {
  "name": "Lassen Peak Trail",
  "description": "While only 2.5 miles each way, this trail has a 2000 ft elevation gain. Starting at 8000 ft near the parking lot, you start off with a steep climb that continues relentlessly from there until you get near the top. Then the trail turns into a very steep climb to the summit at over 10,000 ft. \r\n\nThe trail is well marked so you won't have much chance of getting lost. It is a very popular trail with plenty of traffic. It's almost entirely exposed with only a handful of partially shaded areas. It would be in your best interest to come up to Lassen a day or two before to get acclimated before attempting this hike.",
  "location": "Shingletown, CA"
 },
 {
  "name": "Cinder Cone Trail",
  "description": "Pass the main access to the cinder cone (Cinder Cone Trail N. Access). A short time later, turn left onto the trail that seems to circle the cinder cone.\r\n\nHike around the cinder cone, then turn left up its eastern/southeastern flank. The trail is steep, cinder, and less maintained than the trail up the northwestern flank.\r\n\nOnce on the rim, hike along the outer rim (0.6 miles) for outstanding views of Mt. Lassen and the surrounding colorful cinder fields. Or, hike around the inner rim (0.5 miles) for an in-crater experience without needing the stamina required to reach the bottom.\r\n\nThere is also a trail to the bottom of the crater (0.1 miles one way), but be prepared to hike back up the very steep trail!",
  "location": "Chester, CA"
 },
 {
  "name": "Bumpass Hell Trail",
  "description": "This is a pretty easy trail that is family friendly. It features a gradual gain in elevation until you enter Bumpass Hell. From here, there is a steeper grade heading back down, ending in boardwalks over a series of thermal pools. The trail is pretty even and easily completed with a decent treaded shoe. \r\n\nThere is lots of educational material at the boardwalks for kids and adults alike. The trail is mostly uncovered, making a hat and water necessary as the sun is really hot here. The trail starts at a large parking lot that fills up by noon so come early. It's a little over 3 miles but can be extended if you add Crumbaugh Lake Trail  or Mill Creek Falls Trail. Either way, this is a great unique, quick trail with or without kids.",
  "location": "Shingletown, CA"
 },
 {
  "name": "Brokeoff Mountain Trail",
  "description": "The trail begins near the southwest entrance to the park. It ascends from the park road to the top of Brokeoff Mountain, a remnant of Brokeoff Volcano. The first half of the trail is mainly in forest and is near a stream in places. The last half is more exposed with occasional trees and magnificent views in every direction. Areas of snow can cover parts of the trail into mid-summer. Aside from the scenery, the trail offers wildflowers and wildlife. Forest Lake is near the trail about one-third of the way up.\r\n\nViews include Lassen Peak, Mount Harknes, Mount Shasta, the upper Sacramento Valley and Coast Range, Lake Almanor and more. At the top, you look almost straight down at the Kohm-Ya-Mah-Nee Visitor Center.",
  "location": "Chester, CA"
 },
 {
  "name": "Stuart Fork Trail",
  "description": "From the trailhead, follow an old road to the Trinity Alps Wilderness boundary at Cherry Flat. Climb gradually along the Stuart Fork of the Trinity River.\r\n\nAfter 4 miles, the trail crosses Deep Creek over a bridge and then crosses Oak Flat.\r\n\nAt 5 miles, pass the turnoff for the Alpine Lake Trail. The trail continues to climb gently, crossing Deer Creek over a bridge at around 7 miles. Pass the junction with the Deer Creek Trail at 8 miles and reach Morris Meadow at 9 miles.\r\n\nMorris Meadow has awesome wildflower displays all summer and plenty of campsites.\r\n\nBeyond the meadow, the trail turns west into more mountainous territory. At 12 miles you'll reach Portuguese Camp, the last good spot to camp before Emerald and Sapphire Lakes.\r\n\nThe trail becomes steep and open as it climbs west toward Emerald Lake. Emerald Lake is actually man-made, created for mining operations a century ago. There's still a lot of old mining equipment lying around.\r\n\nFollow the cairns around Emerald Lake's north shore and then climb 600 feet to the trail's end at Sapphire Lake. At the deep, clear lake, enjoy the views of Thompson Peak and the Sawtooth Ridge.",
  "location": "Weaverville, CA"
 },
 {
  "name": "PCT: Etna Summit to Seiad Valley",
  "description": "Pacific Crest Trail (PCT)",
  "location": "Weed, CA"
 },
 {
  "name": "Hidden Valley Route",
  "description": "The trail begins at Bunny Flat. Head upward on the moderate, heavily-used trail through sparse pines. After 0.1 miles, turn sharply left following signs for the Horse Camp. Continue another 0.9 miles to another trail junction; stay right here, again following signs for the Horse Camp. From here, the grade of the trail steepens and becomes dustier as it heads uphill through the forest.\r\n\nThe forest breaks into meadows and views of Mt. Shasta just before the Sierra Club cabin at the Horse Camp, 0.7 miles later. Keep left and head around the cabin to pick up the trail to Hidden Valley (marked with a dubious rock sign).  If unsure of the trail, ask the volunteer who often hangs out near the cabin, or find the trail closest to the north corner of the cabin.\r\n\nThe trail is flat for a short distance, then begins climbing at a truly alarming rate upward via switchbacks and vague trails through scree fields. Flags have been strategically placed to aid the hiker in following the trail, although even the flags may be slightly sketchy at times. Views open up of the town of Mt. Shasta, Yellow Butte, Castle Crags, the Trinity Alps, and more.\r\n\nAbout a mile beyond the Horse Camp, the trail turns to the right to begin traversing the hillside, still upward, above a rocky canyon. A couple waterfalls are visible in the canyon below.\r\n\nAt 3.3 miles from the trailhead, the trail suddenly enters a saddle in the hillside. This is the entrance to Hidden Valley. At the same time, jaw-dropping views of Mt. Shasta and Shastina suddenly open up above Hidden Valley. Hike down to the stream, or opt to scramble around the valley for more spectacular views.\r\n\nNote: Hidden Valley may be filled with snow late into the summer months, even after the rest of the trail melted months earlier.",
  "location": "Mount Shasta, CA"
 },
 {
  "name": "Big Bear Lake Trail",
  "description": "The total hiking distance is 10 miles round trip. Drive to the trailhead from the north. Some maps show the Bear Creek Road connecting through to the highway to the south, but it definitely does not. \r\n\nThe trail starts from the south side of the parking area, and meanders almost down to the Trinity River before making the first (and only unbridged) crossing of Bear Creek. Switchback up for a few minutes, and you'll see your car again very close from across the creek....If you don't mind getting your feet wet you could save 1/4 mile here. The trail will climb steadily the rest of the journey up to the lake, mostly through forests and along the creek.  \r\n\nThere is a good campsite/picnic site about halfway up right along the trail. The route is mostly shady but can be hot in summer. The trail itself seems well-maintained with a stock bridge crossing Bear Creek the second time. A section of ferns along the trail near the top was fairly overgrown but otherwise it was open hiking under pine trees and other types of forest.  \r\n\nAbout 1/2 mile from the top, you can finally see views of the granite, jagged peaks of the Trinity Alps. There are some nice waterfalls and campsites below the lake along the creek, and this is a popular weekend backpacking trip. Big Bear Lake is great for swimming, although access to the water is limited to boulders as the vegetation is thick. It's possible to travel off-trail to Wee and Little Bear Lakes for more camping options or a longer weekend outing.   \r\n\nReturn the same way to descend back to the trailhead.",
  "location": "Dunsmuir, CA"
 },
 {
  "name": "Falls Loop Trail",
  "description": "Falls Loop Trail is one of the most comprehensive, well-maintained, and shortest trails in Shasta County. The trailhead doubles as an overlook and starts only a couple hundred feet from the parking lot. As you start your 1-mile hike, you'll cross over a sweet footbridge that takes you over Burney Creek (the water here feeds into the falls) and eventually down into the valley. It's pretty self-explanatory, given that there's only one way to go, but you'll notice signposts marking the Pacific Crest Trail that sits only a few hundred feet away.\r\n\nAs you make your way down, remember that the loop will take you in a clockwise direction back up to the trailhead. Notice the drastic drop in temperature (especially in the summer) as you get closer to the base. Parts of the trail are shaded, thanks to the covering provided by the trees. Once there, you'll stand in wonder of the majestic 129 foot Burney Falls with many vantage points. \r\n\nFinishing the loop requires you to hike back up with an elevation gain of about 200 feet. There are a couple switchbacks, each featuring a functioning water fountain to cool you off.",
  "location": "Burney, CA"
 },
 {
  "name": "El Cajon Mountain Summit Trail",
  "description": "Note: El Cajon Mountain is the mountain's official name, but El Capitan is used colloquially. The two terms are used interchangeably by locals, but there is only one El Cap, and it is in Yosemite.   \r\n\nGetting there: The trailhead is located on the right side of Wildcat Canyon Road when traveling from Lakeside to Barona Indian Reservation. Expect the main parking lot and the Oakoasis county preserve parking lot located across the street to be full on the weekend. There is limited parking on the roadside, but be careful as this road is busy and dangerous. Get there right at 8 a.m. when the gate opens to avoid the heat and crowds. \r\n\nThe Trail: With the exception of the .5 miles above the trailhead and the .25 miles below the summit block, this trail is more of a wilderness freeway/doubletrack truck trail. The concept of switchbacks clearly eluded the trail builders as it takes a very direct path up the mountain. It is well traveled so one does not get the back-country adventure feel, however this is ideal for a quad-burning hike. It is very well-signed; route finding will not be an issue.\r\n\nDirections: From the parking lot, head up a dirt road with a 100yd section of reddish concrete road. Private property lines this road, but don't be fooled this is not someone's driveway. The official trailhead is .5 miles up the road and has bathrooms and picnic tables, but there is no parking allowed here. Pass the bathrooms, follow signs for El Cajon Mountain and take a left at the fork. The trail turns to singletrack switchbacks and continues to climb for another half mile. \r\n\nAt the top of the ridge, the trail widens to dirt singletrack and continues at a moderate downhill grade for the next 1.2 miles. Multiple trails crisscross the main trail in this section but stay on the most obvious path and follow signs for El Cajon Mountain Summit. The next 1.7-mile section is wide doubletrack but is extremely steep and loose gravel makes footing tenuous. This is the most strenuous section of the climb. The trail then levels out on a ridge with great views. This is a common turnaround point and is a perfect stopping point for a moderate 7 mile out-and-back. \r\n\nAfter this point, the trail narrows and follows a very rocky, shaded wash downhill for .7 miles. The next mile is a steep climb on less well-maintained doubletrack. The final quarter mile push to the summit is on a steep, rocky, slightly overgrown singletrack trail with light scrambling required. The trail is faint, but very well marked.",
  "location": "Lakeside, CA"
 },
 {
  "name": "Mt. Baldy Trail #7W12",
  "description": "The trail starts at the end of Bear Canyon Drive. From the visitor center, hike southwest through the site past a gate to the road and then proceed a half mile up the road. The trail starts by crossing the stream then climbs gently through Bear Canyon in a forest of oak, bigcone spruce, alders, bay, and incense cedar with occasional areas of chaparral that have good wildflowers in spring. After 1 mile, the trail reaches Bear Flat where there are a few camping sites near a seasonal spring.\r\n\nA pleasant meadow offers a nice resting point after which the trail steeply switchbacks up through shadeless chaparral of ceanothus and oak finally reaching some Jeffrey Pines near the top of the ridge. About 2 miles up, it passes into the Sheep Mountain Wilderness then continues steeply north on the ridge offering outstanding views of Coldwater Canyon to the west.  Sugar pines and white fir offer refreshing shade. A bare ridge with steep slopes on both sides is crossed, and the trail enters into a lodgepole pine forest with mounds of chinquapin groundcover. The trail continues along the edge of a large natural depression as it turns northeast on the slope of West Baldy. Finally, the trail reaches the west ridge of Mt. Baldy and climbs up to the 10,064 ft. bare summit. The highest point in the San Gabriel Mountains has outstanding views in all directions.\r\n\nBe sure to look back at the direction you came. People have died taking a wrong turn on the descent. Dangerous weather can occur at any time of the year. The temperature difference between the bottom and top can vary as much as 40 degrees. Snow can linger well into late spring and summer. This is a strenuous hike at high elevation and proper hydration is critical for your health.",
  "location": "San Antonio Heights, CA"
 },
 {
  "name": "Pine Knot Trail 1E01",
  "description": "This route is one of the nicer trails in the Big Bear Lake area. It starts from a campground and picnic area that is accessible with your car and ends at the Grand View Point overlooking the mountains and the forest. Along the way, you'll be able to get very nice overlooks over the lake itself. Towards the end, there is a small camping area (no water). The path is mostly dirt road. Look out for snakes and bears.",
  "location": "Big Bear Lake, CA"
 },
 {
  "name": "Kwaay Paay Peak Trail",
  "description": "There are several trailheads with trails leading to Kwaay Paay Peak. This trailhead is located on Father Junipero Serra road closest to the dirt parking lot. You can park on Junipero Serra road, but if you're planning on staying past 7 pm, park on the dirt parking lot at the entrance to Mission Trails Park.\r\n\nThe trail begins with a steep climb and never lets up. You encounter several flat places where you can give your legs a rest, but you face another steep climb near the end.\r\n\nOnce you reach the top, you are rewarded with 360-degree views of San Diego and of the entire Mission Trails Park.\r\n\nBe cautious on the return trip since the steepness can be treacherous. Trekking poles are recommended but not required.",
  "location": "Santee, CA"
 },
 {
  "name": "Icehouse Canyon Trail #7W07A",
  "description": "Adventure Pass required to park at trailhead.  Lot fills early on weekends. Do no leave valuables in car. Please do not cut switchbacks which damages the trail.",
  "location": "San Antonio Heights, CA"
 },
 {
  "name": "Cucamonga Peak Trail #7W04",
  "description": "The San Sevaine Road is only open to vehicles from after Labor Day to March 1. Call the Lytle Creek Ranger Station (909-382-2851) for current road and trail conditions and wilderness permit availability.  High clearance vehicles strongly recommended.\r\n\nAdventure Pass required to park at the Icehouse Canyon Trailhead. Lot fills early on weekends.",
  "location": "Rancho Cucamonga, CA"
 },
 {
  "name": "Devil's Backbone Trail #7W05",
  "description": "Adventure Pass required to park at Manker Flat. Trail is very dangerous if there is snow or ice.",
  "location": "Wrightwood, CA"
 },
 {
  "name": "Rattlesnake Canyon Trail",
  "description": "Starting from the trailhead, which is located alongside Las Canoas Road, head north past the Rattlesnake Canyon Wilderness sign. Soon after beginning your hike you'll cross the creek and climb slightly up the hillside. 1/2 of a mile into the trail you'll see another trail diverging to the right. This trail makes for a great byway that later reunites with the main Rattlesnake Canyon Trail a mile later. However, continuing along the main trail you cross over the creek a couple of times before reaching a huge, flat rock, known as \"Lunch Rock\", that sits in the creek.\r\n\nAfter crossing the creek once again you'll follow the trail to Tin Can Meadow, which was named after a homestead cabin that once existed there before it unfortunately burned down in 1925. A trail junction sits at the end of this meadow, at which point you'll want to bear right to follow the Rattlesnake Canyon Trail for another 3/4 of a mile until it hits Gibraltar Rd. The Rattlesnake Canyon Trail ends at this intersection with the road, but there are stunning views of the South Coast from this point.\r\n\nThanks to John McKinney, The Trailmaster, for sharing this trail description. To learn more about trails in California, check out his guides at The Trailmaster Store.",
  "location": "Mission Canyon, CA"
 },
 {
  "name": "Mount Rubidoux Drive",
  "description": "Mount Rubidoux is right in the middle of Riverside. It is a great place to hike, run, walk, or ride bikes up and down if you want to get some exercise. This is a common hike in the area, and there are plenty of people who get out to enjoy it. \r\n\nThere are a few different paths you can take, but they all lead to the same place. Once you are at the trailhead where the sign is, the trail splits. You can take the right path which is the easier path with the slowest elevation gain, or you can take the left path which has more incline, but gets you to the top faster. Once at the top, the trails meet and you can take the opposite one down of the one you came up on and get the full effect of the mountain. \r\n\nFeel free to bring your dog as long as it is leashed. Be sure it is ok around other people and other dogs. Sometimes there is a good number of people on these paths with their dogs.",
  "location": "Riverside, CA"
 },
 {
  "name": "Skyline Trail",
  "description": "The Skyline Trail is a great singletrack trail that traverses the mountains above Big Bear Lake and the Snow Summit Ski Resort. Beginning at the end of Dogwood Dr., where it turns to dirt, the trail immediately begins climbing the mountainside and continues to do so for 1.8 miles while often utilizing switchbacks. After another short climb the trail arrives at the top of Snow Summit before switchbacking as the trail rolls up and down alongside the side of the mountain. After being on trail for 10.2 miles you'll reach a big descent that will end with a slight uphill that exists just before the end of the trail. The trail ends as it reaches Metcalf Creek, from which point you can follow service roads back to Big Bear Lake.",
  "location": "Big Bear City, CA"
 },
 {
  "name": "Holy Jim Trail #6W03",
  "description": "The Holy Jim Trail leads from Trabuco Creek Road to North Main Divide Road, rising a little more than 2,300 feet over 5.2 miles.\r\n\nTo reach the trailhead on Trabuco Creek Road, off road or 4 wheel drive vehicles are recommended. \r\n\nThe trail heads north from Trabuco Creek Road on the canyon road for about 0.5 miles before turning into a trail. The trail follows the creek, crossing it several times. At about 1.4 miles there is a junction, take a left to continue up the west side of the canyon via switchbacks. Around 3.5 miles the trail begins to wind through more trees and there is less low level brush. At 5.2 miles the trail reaches North Main Divide Road.\r\n\nThanks to John McKinney, The Trailmaster, for sharing this trail description. To learn more about trails in California, check out his guides at The Trailmaster Store.",
  "location": "Trabuco Canyon, CA"
 },
 {
  "name": "Trabuco Canyon Trail",
  "description": "Trabuco Canyon Trail is travelled in both directions, and is often used to complete loops. The trail is 100% singletrack.\r\n\nAs mapped, the trail starts to the right around a green guard barrier and heads down immediately.  Initially the trail will be in deep shade but will alternate between shade and sun. The trail definitely has a \"beginning, middle, & end.\" The beginning is nice - a little loose and occasionally rutted, but mostly fun & easy going with some chances to appreciate the view. At a 90-degree left turn, keep an eye out for the \"Christmas Tree\" that gets an ornament or 2 around the holidays.  \r\n\nYou'll know you're in the 'middle' section when the shale begins and the shade goes away. This section requires a little caution, since the trail traverses sharp gravel and there are a few steeper (~15% grade) spots. \r\n\nShortly after the shale ends, you'll come to Trabuco Creek, a mostly dry wide rocky creek crossing. Once on the other side, the grade decreases and the trail is more pleasant (still some rocks and roots through). Another green guard gate marks the end of the trail.",
  "location": "Lake Elsinore, CA"
 },
 {
  "name": "Holy Jim Falls Trail",
  "description": "From the junction with Holy Jim Trail take a right to head west on Holy Jim Falls Trail. This follows the creek so it includes some boulder-hopping; the trail leads up to Holy Jim Falls, a 20 ft tall waterfall.\r\n\nThanks to John McKinney, The Trailmaster, for sharing this trail description. To learn more about trails in California, check out his guides at The Trailmaster Store.",
  "location": "Trabuco Canyon, CA"
 },
 {
  "name": "Horsethief West Trail #6W11",
  "description": "Land Manager:  USFS - Cleveland National Forest Office",
  "location": "Trabuco Canyon, CA"
 },
 {
  "name": "Summit Trail",
  "description": "This trail travels between a trailhead low on Mount Diablo State Park's South Gate Road (no parking) and the summit of Mount Diablo via the south face of the mountain. Parts of the trail are singletrack and parts are dirt road. \r\n\nLeaving the South Gate Road Trailhead, this trail climbs up canyon into the Rock City area, interesting for its geology and for its bouldering opportunities, and meets Wall Point Road coming in from the west. Despite the various trail names you'll encounter here (maps and trail signs may not agree with each other), there are several possible \"Summit Trail\" routes from here going uphill, and all will take you eventually to the shoulder of South Gate Road, so you can be creative. \r\n\nOnce you have passed the Ridge View Trail and crossed South Gate Road, and are climbing with the road to your left, you'll see the summit ahead of you, and views will begin to open up in the other directions. This trail's route is now more direct, and sometimes quite steep. You'll be encountering areas that burned during the Morgan Fire of September 2013, and in these areas vegetation will be quite different (in the spring, wildflower blooms can be excellent). Along the way this trail crosses Summit Road twice. Then, approaching the summit area, this trail contours just below Summit Road, providing fine views to the south. \r\n\nAt Devils Elbow, this trail grazes the outside edge of a hairpin turn on Summit Road (North Peak Trail departs from here going east) and switches back just above it. Soon this trail reaches the summit area, with a parking area to the left. To the right, you'll see Mary Bowerman Trail (aka Fire Interpretive Trail, referring to the Morgan Fire) veer right, but instead this trail crosses the one-way vehicle road leading toward the summit and continues into a thin \"island\" of rocky outcrops inside the one-way vehicle road loop. \r\n\nContinue on this trail to the actual summit, where you'll find a restroom building as well as the summit building with an observation deck on the roof. From there, you enjoy expansive views in all directions.",
  "location": "Diablo, CA"
 },
 {
  "name": "Eagle Peak Trail",
  "description": "From the oak savannas along Coulter Pine Trail, the Eagle Peak Trail heads south and climbs steadily through dense chaparral to join the Mitchell Rock Trail just south of Twin Peaks. Continue south, climbing a fine ridge to the summit of Eagle Peak. From the summit, the trail descends through more chaparral to end at Murchio Gap and Meridian Ridge Fire Road.",
  "location": "Clayton, CA"
 },
 {
  "name": "Deer Flat Fire Road",
  "description": "From Diablo Valley Overlook, head straight through Juniper Campground, and the trail is at the end of the \"U\". There is a small singletrack trail that leads you up to the fire road. The rest of the trail is very open. There are areas of pretty steep incline and decline, but the views are beautiful the whole way. This trail leads up and splits off between many different trails in Mount Diablo State Park, so it is a great trail to start your hike on.",
  "location": "Diablo, CA"
 },
 {
  "name": "Oyster Point Trail",
  "description": "This is a little more rugged singletrack, especially considering how much work it is to get there. But it's totally worth the effort!\r\n\nThe first half of the trail is mostly climbing on the side of a steep hill that parallels a creek. It's curvy, narrow and exposed. \r\n\nThe second 1/2 is continuous and well graded downhill (there are some steep sections). Again, it is narrow, curvy and exposed as it traverses steeply down into Jackass Canyon.\r\n\nThe trail ends at Finley Rd. To return on paved roads, turn right on Finley Rd. It starts as dirt but turns paved at the park entrance. Continue down Finley Rd to Camino Tassaraja Rd.",
  "location": "Blackhawk, CA"
 },
 {
  "name": "Falls Trail",
  "description": "This narrow, rugged trail forms part of a loop around the headwaters of Donner Creek. From Cardinet Oaks Road, hike south across a grassy hillside, climbing gradually toward the first waterfall. From there, continue west and then descend to another waterfall. The trail heads north before ending at a junction with the Middle Trail.\r\n\nThe waterfalls on this trail are best after a series of good winter rains. They might be dry in the summer.",
  "location": "Clayton, CA"
 },
 {
  "name": "Bald Ridge Trail",
  "description": "From Murchio Gap, climb up into the grasslands and shrubs on Bald Ridge. The wildflowers here are excellent in March, April, and May, and there's a good view of Mount Diablo. Keep climbing across a forested hillside, then cross a small canyon to end at Prospectors Gap.",
  "location": "Clayton, CA"
 },
 {
  "name": "Rowell Ridge Trail",
  "description": "This trail follows Rowell Ridge and offers spectacular views of the San Antonio Reservoir and the Tri-Valley. Murietta Falls Trail is to the left after 500 yards. Continue straight and descend steeply for about half a mile. Several old cattle enclosures are to your right. Continue further along the grassy ridge and reach a locked gate at the end of the trail.",
  "location": "Livermore, CA"
 },
 {
  "name": "Chamise Trail",
  "description": "Land Manager:  East Bay Municipal Utility District (EBMUD)",
  "location": "Danville, CA"
 },
 {
  "name": "North Peak Trail",
  "description": "This trail is very well marked and can be connected to by the Prospector's Gap Fire Road. This trail felt completely different from the fire roads we were taking the rest of our hike. It is a singletrack through some trees and up and out along the side of the peak. \r\n\nThe North Peak Trail can connect to Summit Trail which will lead you directly to the summit or to Summit Road which will lead you to Juniper Trail. Enjoy the beautiful views of the east side of Mount Diablo!",
  "location": "Blackhawk, CA"
 },
 {
  "name": "Las Trampas to Mt. Diablo Regional Trail",
  "description": "This regional trail provides trail access between the east edge of Las Trampas Regional Wilderness and the southwest corner of Mount Diablo State Park, at Macedo Ranch Staging Area. This unusual trail winds its way through several neighborhoods and open space areas, sometimes as singletrack, sometimes as dirt road, and sometimes as sidewalk.",
  "location": "Alamo, CA"
 }
]